{
  "title": "'Ard Boy",
  "url": "https://wh40k.lexicanum.com/wiki/%27Ard_Boyz",
  "content": "'Ardboyz are heavily armoured Ork Boyz who own and wear 'Eavy Armour.[1]\n 'Ard Boyz cover themselves in thick scrap metal plates that they've scavenged. This is the stuff of their armour and despite poor maintenance, the result is armour than can withstand most small arms fire. This gives the 'Ard Boyz the appearance of walking magnets though it is considered unwise to tell them.[1] 'Ard Boyz are equipped with either Sluggas and Choppas or Shootas and can equip stikkbombz. An 'Ard Boyz Mob consists of 10 to 30 'Ard Boyz which may include a Nob. Other weapons found in 'Ard Boyz mobs are big shootas and rokkit launchas.[1a]\n Only veterans who have managed to survive many battles and slaughtered many foes have the chance to scavenge sufficient materials to build or purchase such an Armour. This also means that 'Ardboyz are excellent scavengers even above the normal Ork ability. 'Ard Boyz usually spearhead Ork advances as their increased durability allows them to survive heavy fire fights with barely a scratch.\nMobs of 'Ardboyz retain all the versatility of classic Boyz mobs, thus being able to fill the roles of Shoota Mobs or Slugga Mobs, but usually go for the latter, as their armour proves more useful when close to the enemy.[1]\n In the Ork hierarchy, 'Ard Boyz tend to hold a position just below Nobs (though given the unpredictability and flexibility of Orks this is not a hard rule).\nMore techno-hesitant Ork Clanz (such as the Snakebites) tend to look down upon 'Ard boyz, seeing their love for heavy armour as a sign of weakness and cowardice. 'Ard Boyz are more frequent among the Bad Moons and Deathskulls Clanz, as both of those Clanz tend to be naturally wealthy or streetwise enough to gather the materials for the armour.\nThey usually grow arrogant and laugh at their less-armoured comrade casualties, who in turn call them \"walking magnets\" (referring to their attitude to pick up scraps for their armour as they proceed in the battle) when not heard.[1]\n 'Ard Boy with Shield[2]\n 3rd Edition Miniatures[3]\n \n"
}