{
  "title": "Barban Falk",
  "url": "https://wh40k.lexicanum.com/wiki/%22The_Warsmith%22",
  "content": "Barban Falk, later simply known as The Warsmith, was a warlord of the Iron Warriors in late M41.\n During the Horus Heresy, Barban Falk was a Warsmith of the 126th Grand Company who was part of Perturabo's select Trident and was known for his abnormal and imposing size and strength. He was appointed to the Triarch alongside Kroeger in the aftermath of the First Siege of Hydra Cordatus and Battle of the Phall System that saw Triarch's Harkor and Golg disgraced and killed, respectively. Later it was during a pitched battle in the depths of an Eldar tomb citadel that Falk was contacted by a daemonic entity. He used the warp presence's power to focus and command his Iron Warriors. After the escape from the Eldar tomb world of Amon ny-shak Kaelis, First Captain Forrix called Falk by name, and Falk replied, \"I no longer know that name, I am simply the Warsmith.\"[2]\n By the Siege of Terra Falk had become aloof with the concerns of the material, insisting on simply being referred to as The Warsmith and scoffing at former superiors such as Forrix. Forrix feared that like the Daemon Primarch's, Falk's ambitions lay with Chaos and not with simple victory on Terra.[6]\n Kalkator's Grand Company operated a Vindicator siege tank named after Barban Falk.[5]\n In late M41, \"The Warsmith\" was described as a powerful warrior in Daemonic armor, giving off a feeling of dread even to his hardened lieutenants.[1a] Leading a Grand Company to the Imperial world of Hydra Cordatus, The Warsmith intended to topple the seemingly impenetrable Imperial fortress there and steal the large amount of Gene-Seed hidden within, an act he hoped would gain him enough favor with the Gods of Chaos to ascend to Daemonhood[1b]. After a bloody battle, the Warsmith was successful in his quest and became a Daemon Prince, traveling to the Warp and leaving control of his forces to his only surviving champion, Honsou.[1c]\n Before his ascension, \"The Warsmith\" was the castellan of the fortress of Khalan-Ghol on Medrengard.[3] In addition to his martial abilities, he was a collector of several interesting tomes of Chaos knowledge. After the fortress was destroyed, Honsou found one tome that led him to the location of the Daemon Prince M'kar the Reborn.[4]\n"
}