{
  "title": "Battlewagon",
  "url": "https://wh40k.lexicanum.com/wiki/%27Krusha%27_Battle_Wagon",
  "content": "A Battlewagon is a common type of large Ork vehicle.\n Designed to carry a whole fighting mob of Orks, plus any Gretchin, Snotlings, Squigs or shiny things that may belong to the mob, Battlewagons are typically large, heavy and noisy. Ownership of a Battlewagon marks an Ork out as particularly prestigious or 'flash'. A typical Battlewagon owner is most likely a Nob of some description, though various Oddboyz may have access to Battlewagons at certain times. Warbosses often mount themselves and their immediate retinue in Battlewagons when travelling to battle, and may have more than one if their retinue is of sufficient size.[1]\n Like all Ork vehicles, Battlewagons do not conform to a set standard, although the Mekboyz of the Ork clans do tend to lean towards building their Battlewagons based around an initial chassis design that is somehow known to them almost instinctively. Past this initial point however, Battlewagons will tend to look rather unique as various Meks and decoratively-minded owners get their hands and hammers on the vehicle. Most Battlewagons come with flagpoles bolted on somewhere so the owner can display his personal or clan banner in a prominent place, as well as thick armour plate in most locations - though many Battlewagons are open-topped.[1]\n A Kannon, Zzap Gun, Lobba, or a Lifta-Droppa along with an array of Big Shootas and Rokkit launchas, Deffrollas, Stikkbomb Chukkas, and Grabbin' Claws are popular weapons choices for a Battlewagon.[2] They are not particularly fast and so not all that popular with Mekboyz, who prefer their own rides to be significantly more speedy, not to mention kustomized. The chief advantages of Battlewagons is that they are sturdy and well-armoured, offering the passengers good protection (until they stick their heads out from behind the armour plate to see what's going on) and can transport a large number of Orks and their equipment directly into battle.[1]\n Krushas are a popular subtype of Ork Battlewagon which includes Bonebreakas, Bonecrushas, Spleenrippas, and Gitmashers. These combine armored transport capabilities with an arsenal of heavy firepower and an enormous spiked Deff Rolla to create an devastating assault vehicle used to spearhead assaults.[7]\n Gunwagons are another popular subtype of Ork Battlwagon, that forego a substantial portion of their transport capability in order to mount heavy artillery. Little more than armor-plated mobile gun platforms, these vehicles advance towards the enemy at a steady crawl, hammering firepower at the enemy ceaselessly. Inside their cabins, the tanks' spotters peer through kustom lookin'-tubes and tele-gubbinz, calling out fresh targets to their gun crews. The only real drawback to these designs are the devastating explosions that result should a gunwagon be hit with enemy fire. The Orks, being Orks, see this less of a flaw and more of a golden opportunity to take the enemy with them.[7]\n Battlewagon\n Gunwagon\n Bonebreaka\n Lifta Battlewagon[3]\n 1st Edition Battlewagon\n Epic Battlewagon\n This article needs work on its citations.For help on citation see the citation guidelines. You can help Lexicanum by fixing it.\n \n"
}