{
  "title": "Bragg",
  "url": "https://wh40k.lexicanum.com/wiki/%27Try_Again%27_Bragg",
  "content": "Bragg was a Trooper of the Tanith First and Only[1a], serving in the regiment's eleventh platoon.[7]\n One of the original Tanith recruits to the regiment, Bragg was notable for two particular reasons - his sheer size (being by far the largest man in the regiment, strong enough to wield an assault cannon or heavy bolter single-handed and unaided by power armour[1b][3a]) and his terrible aim, which earned him the nickname 'Try Again' Bragg.[1a] Bragg had a simple nature, although many who didn't know him assumed that he was stupid.[2][3c]\n \n In the Sabbat Worlds Crusade's assault on Caligula, Bragg was on a troop-ship which was shot down by a psychic storm over Nero Hive. Thanks to the leadership of Colonel-Commissar Ibram Gaunt, the survivors of the crash managed to reunite with the rest of the Crusade.[3b]\n Once the daemon generating the storm over Nero was destroyed, the Imperials managed to gain control of the planet. Colonel-Commissar Gaunt was part of the efforts to rebuild Caligula, having been placed in charge of coordinating relief convoys from Aurelian Hive by General Thoth. The main obstacle he faced was the threat of bandit attacks on the convoys - not only were the bandits too hard to pin down and eliminate directly, but they had inside knowledge of the convoy routes. When Comms-Officer Raglon analysed the hive's vox traffic and discovered an information leak, Gaunt had Bragg take charge of a convoy headed to Hive Calphernia in order to identify the traitor and draw the bandits out into the open. Bragg was successful on this mission, taking the collaborator down and exposing the bandits to an attack by Marauder Bombers.[3c]\n On Menazoid Epsilon, Bragg was later part of the team that Colonel-Commissar Gaunt selected to accompany him on a secret mission.[1c]\n In the closing stages of the Siege of Vervunhive, Bragg was one of thirty Tanith selected personally by Gaunt to take part in Operation Heironymo, the mission to infiltrate The Spike and assassinate Heritor Asphodel. During the mission, Bragg saved the lives of Haller, Dremmond and Muril by grabbing onto them when they almost fell off the Spike whilst trying to board it.[4]\n In the Hagia campaign, Bragg was part of a clearance team led by Major Rawne during the battles to reclaim the Holy Doctrinopolis from the Infardi. At one point, Bragg was shot in the shoulder, but survived.[5a]\n While recuperating, Bragg and four other Troopers volunteered to accompany Colonel Corbec and Captain Daur to the Shrinehold of Saint Sabbat after the officers had experienced visions of the Sabbat Martyr, in defiance of the Guardsmens' orders to evacuate Hagia in the face of incoming Chaos reinforcements.[5b] Along the way, Bragg struck up a friendship with Trooper Vamberfeld, one of the new Verghastite recruits drafted into the regiment following the Siege of Vervunhive. Corbec asked Bragg to watch Vamberfeld, who had been suffering from severe mental stress.[5c]\n Eventually the Guardsmen reached the Shrinehold and met up with the rest of the honour guard, who were defending themselves against an army of the Infardi that had followed them up into the Sacred Hills.[5d] During a lull in the fighting, Vamberfeld made his way to the shrine's sepulchre, clutching a jiddi-stick that he had found on the journey, convinced that it was the Saint's own (Sabbat having been born to a lowly chelon herder). Bragg followed Vamberfeld and tried to calm him down, but they were confronted by Greer, the driver that Captain Daur had coerced into operating the Chimera that they had taken to get to the Shrinehold. Daur had convinced Greer that the Guardsmen were actually journeying into the hills to retrieve a stash of gold ingots hidden by ayatani priests and Greer, who by this point was practically delirious from exhaustion, believed that Bragg and Vamberfeld were trying to steal the gold from him. Although Bragg and Vamberfeld tried to persuade him, Greer shot both of them with his autopistol.[5e] The Tanith medics were able to resuscitate Bragg, however.[5f][6]\n Bragg was wounded once again, this time during a training exercise prior to the assault on Cirenholm on the planet Phantine, when Trooper Lijah Cuu stabbed him. Cuu claimed that, in the heat of the exercise, he mistook his knife for his nonlethal training weapon.[6]\n The following information is not to be regarded as officially sanctioned and/ or is not written from an in-universe point of view. A detailed explanation of the term \"Trivia\" as used in the Lexicanum can be found here.\n"
}