{
  "title": "D'onne Ulanti",
  "url": "https://wh40k.lexicanum.com/wiki/%22Mad%22_Donna",
  "content": "D'onne Astride Ge'Sylvanus of the House of Ulanti,[2] often shortened to D'onne Ulanti and better known as \"Mad\" Donna (also spelled Mad D'onna),[4]  was the twelfth daughter of Sylvanus, Patriarch of the Noble House Ulanti in the Spire of Hive Primus on the Imperial world of Necromunda.[1]\n Donna's destiny was to follow the course of all the noble daughters in Hive Primus, and to be married off for political reasons when the time was right, but life would take a drastically different turn for the Lady Ulanti.[1]\n In order to keep her pure for the proposed future marriage, her father Sylvanus locked her in a needle thin tower on the outside of the Spire. What happened to her during her years of isolation out there no one will ever know. Some say that her father used to come into the tower and torment her. Some say that she could not endure living under the vast ceilingless skies of the outside. Whatever caused it, nobody could have guessed the extent to which her sanity had been affected. Her future husband had been selected and she was brought out of her tower to meet him at a dinner. The feast was lavish, consisting of foods from offworld served on gold-spun plates, and finest wine poured into crystal goblets. The dinner went well, and her marriage to Count Ko'Iron seemed certain, until they reached the fourth course.[1]\n Calmly and extremely lady-like, D’onne stretched across the table and gouged out the Count's eye with a silver fish fork. Guards charged inside the dining room to find her removing the screaming Count's second eye, but could not understand what was happening or who if anybody they were supposed to shoot. While they remained uncertain Lady Ulanti took the prostrate Count's pistol and shot them both.[1]\n Amidst all of the confusion, she was somehow able to escape the Ulanti palace, get past the wall into Hive City, and then continue down and down until she hit the bottom. In the settlement of Glory Hole she was taken in by an Escher gang and so began a long and colourful career among the gangs of the underworld. Her reputation spread quickly, and her behaviour helped to give her the \"Mad\" moniker to her name. Anyone who got in her way was cut down without question, and one particularly unlucky Goliath was skinned alive. One time, after having a few too many to drink, she decided to remove her own eye because the barman had told her that she was pretty.[1]\n After some time she left the Eschers and then drifted around, running with outlaws near the White Wastes. She led an Orlock gang in search of archeotech at Dead Man's Hole and was the only member of the expedition to return, adding a new aspect to her reputation - the question of whether she was extremely lucky, or cursed.[1]\n Bounty hunters began looking for her and she quickly disappeared. The last time she was seen was in Two Tunnels with the hunters still close behind.[1]\n \"Mad\" Donna Ulanti miniature[3]\n Cover art for Survival Instinct (Novel)[2]\n"
}