{
  "title": "Forge World (company)",
  "url": "https://wh40k.lexicanum.com/wiki/(Forge_World)",
  "content": "Forge World was a subcompany of Games Workshop Inc. that created models outside of the normal auspices of Games Workshop. It was a company dedicated to creating high quality, exotic miniatures for passionate gamers.[1]\n Forge World was created in October 1998, the brainchild of John Stallard and headed by Paul Robins, the man responsible for the original Thunderhawk Gunship. It was announced to the public in the same edition of White Dwarf as the 3rd Edition of Warhammer 40,000.\nForge World was originally created to design Warhammer Terrain (hence the name) and limited edition, large scale collectors edition models.[1] Since then Forge World has expanded to create variant vehicles, large scale titans, accessory sets for various armies and even their own small forces, notably the Elysian Drop Troops released in 2005.\n In 2018, the Forge World studio became the Specialist Design Studio, and continued its involvment in projects related to the Horus Heresy, Epic Scale games, and Necromunda.\n Games Workshop quietly removed the Forge World brand from public view in 2024, completely absorbing its products and online store.[4] The \"Forge World\" brand continues to exist trough the production of resin miniatures for all the games produced by Games Workshop.\n Forge World created many different styles of model for different tastes. All Forge World models werecast from polymer resin, a brittle but very light material that can be used to model extreme detail or, more rarely, etched brass, in the case of their barbed wire sheets and Imperial eagle icons.[Needs Citation]\n Forge World models were geared toward the seasoned hobbyists, and the following warning was on the front page of the website (ca. 2000):[2]  Some of the more complex models require modelling experience to assemble and finish.\nThese models are not toys Not suitable for children under 15 years of age. WARNING: Resin dust can be harmful if inhaled. Always wear a dust mask or respirator when sawing or sanding resin parts.\n Imperial Armour is a series of Warhammer 40,000 vehicles and monstrous creatures for the various races. These represent exotic variants or extremely large vehicles that would be impractical in normal games of Warhammer. The Imperial Armour project also includes accessory and upgrade kits for vehicles and even some specially sculpted troops such as tank commanders for use within Forge World kits.\n \n The Horus Heresy is a series of rules, scenarios, characters, and vehicles set roughly ten thousand years before Warhammer 40,000 during the Age of Darkness.\n \n Forge World has created resin miniatures for the following games :\n Forge World has created a single piece for Lord of the Rings - the Ruined Watchtower of Amon Sul (Weathertop)\n For Warhammer Fantasy/Age of Sigmar and Warhammer 40,000.\nResin terrain, while quite expensive, is beautifully detailed and lovingly created by the Forge World sculptors. It includes everything from simple knee high walls to battlefield spanning fortresses and bases, bristling with weapons.\n Forge World has created a variety of large-scale monsters for Warhammer, including huge dragons, Greater Daemons and a Giant.\n These are large scale, superdetailed models that are usually about 12cm tall. They are the ultimate in collectors pieces for GW fanatics and are some of the most detailed models ever produced under the auspices of Games Workshop.\n Designed for use to add depth and detail to 40k forces or terrain.\n"
}