{
  "title": "Sly Marbo",
  "url": "https://wh40k.lexicanum.com/wiki/%22Sly%22_Marbo",
  "content": "\"My lords, this man is a menace. He disregards Munitorum regulations, he {REDACTED} seemingly at will, and he only answers to {REDACTED} Were it not for the gruesome death toll he exacts upon the Emperor's foes, I would recommend {REDACTED} Yet he is a deadly living weapon. He has wrought butchery on xenos and heritics alike from {REDACTED} to {REDACTED} he was directly responsible for the {REDACTED} Incident, and on Tarloth he killed a little over three hundred enemy combatants using nothing but a {REDACTED}. Unconventional? Yes. Heretical? Verging upon it. Yet through his actions Guardsman Marbo rescued not only the Governor's household, but also, in retrospect, the entire war effort. My lords, after long consideration, I can only recommend that you approve the deployment of Guardsman Marbo to {REDACTED} and thank the Emperor that he is on our side...\"\n Sly Marbo, the 'One Man Army', is a Catachan guardsman. Feared by the enemies of the Imperium for sniping skills that would rival a Vindicare Assassin and survival skills greater than most Space Marines. He has been known to take on entire enemy forces, striking fear into any who threaten Catachan and the Imperium, this has made his reputation legendary and it's said there's little Sly Marbo hasn't killed.[1][2][6][7]\n Guardsman Marbo is one of the fearsome \"Catachan Devils\", the closest thing the Jungle Fighters have to the elite Storm Troopers who aid other regiments. A natural born survivor and a veritable one-man army, he's the ultimate soldier and possesses skills that surpass any of the Imperium's highly-trained operatives. As a Catachan native, the jungle is his element, and he is capable of taking on entire enemy forces through his innate skill at jungle and guerrilla warfare. He strikes from seemingly nowhere and disappears back into the dense jungle. Marbo is famous for his excellent sniping skills and is considered to be one of the deadliest Humans in existence. It is not known whether or not the \"Sly\" part of his name is an earned name as per Catachan tradition, or a given one.[1][3a][10]\n Mysterious and aloof, little is known about Marbo's origins and most of what is said remains speculation. Only Colonel Traupman, Marbo's original commanding officer, knows the truth of his past. It is said that Marbo was one of ten brothers inducted into the Catchan XII Regiment during fighting against Waaagh! Urgok on Ryza, where they were all killed. However, tales of a lone Guardsman returning two weeks later with the head of the Ork Warboss began to surface.[1][9]\n Marbo gained further renown as one of the few survivors who fought against the Dark Eldar incursion of Galabad. The small garrison of Jungle Fighters stationed on the planet were too few in number compared to the xenos hordes, eventually being overrun. Many historians recount the horrific details of long, dark nights of torture, in which the Catachan prisoners were dismembered whilst Wyches and the Mandrakes bathed in the blood of their victims. It was Colonel Traupman who led the relief force that eventually found Sly Marbo, standing alone and armed only with a knife, covered from head to toe in alien blood. Marbo was surrounded by destroyed vehicles, piles of alien bodies and the head of the Dark Eldar leader impaled on a spike beside him.[9]\n The myth of Private Marbo has since become legendary, he has fought his way from one end of the galaxy to the other attached to various Catachan regiments, most notably the famed Catachan II. Within this regiment, Sly works alone - commanders need only give him the order and he will hunt down and kill enemy leaders, break the back of enemy advances and sabotage the mightiest of war machines. On Pardus, it is said that he destroyed a Tau armored convoy by booby-trapping an entire ravine, while on Sask's World he captured a command post single-handed, slaying the alien leader and all of its tentacled bodyguards with just his bare hands and a ration tin. It is said that during the Octavius War Marbo was deployed to blunt the efforts of Hive Fleet Leviathan, and hunted the chameleonic Lictors for sport. Marbo has a collection of medals that would rival an Imperial Warmaster, having been awarded the Star of Terra multiple times for his legendary exploits.[1][4][7][8]\n Both inside and outside of battle Guardsman Marbo is a loner. He has a hard time sympathizing with others, feeling nothing for the suffering of the common people of the Imperium. He prefers to work alone, seeing fellow troopers helping out as needless at best, a liability at worst. He instead sticks to the darkness at all times, even when he is receiving orders from friendly forces. He is utterly silent and acknowledges orders with but a slight nod before vanishing once more to find the enemy. Marbo is a patient hunter, and will wait in an ambush position for as long as it takes. He is the master of blending into his surroundings and covering any trace of his whereabouts so that the enemy has no idea from where the attack is coming. Having slit the throats of his foes he melts back into the shadows and stealthily moves to another vantage point. In this way he throws the enemy army into utter disarray as they frantically try to locate the killer in their midst. In most cases Marbo's actions are not even initially noticed, that is until entire patrols go missing, supply depots are destroyed and command bunkers are discovered filled with corpses. In battle it is said that fighting Marbo is like fighting a shadow. Enemy commanders have sworn that such attacks cannot be the result of a single man and that an entire army must have ambushed them.[1][9]\n Marbo's fellow Jungle Fighters are well aware of his deadly skills at stealth and ambush, knowing that if Sly Marbo does not want to be seen or heard, he isn't - sometimes not even by those of who know he’s around. Many of his allies compare Marbo to that of a small Ork in size, his sheer bulk almost inhuman, his dead eyes being both cold and distant, unfocused and lethal, between missions the only emotion he shows is a mix of sadness and brooding, appearing like a hulking machine running on low power, saving his energy for the fight to come. The Catachan Jungle Fighters hold Sly Marbo in very high regard. At times, Marbo will track a group of Jungle Fighters and help them out at critical junctures. Having the legendary Sly Marbo watching their backs is considered an honour by those he chooses to follow.[3a][3b][4]\n When the forces of the Ork Warboss Killzkar invaded and conquered the mining planet of Dulma'lin, Marbo and the rest of the Catachan II were tasked with sabotaging the Ork war effort. After the main army comprised of Selvian Dragoons were slaughtered en route to the planetary capital, the Catachan's leader, Colonel \"Iron Hand\" Straken, began a solar months-long war of sabotage and guerrilla warfare. Marbo himself was hand-picked by the Colonel to infiltrate a group of deranged cultists, survivors of the Ork assault who had begun to worship them as gods. Marbo slaughtered any in his path, learned the enemies plans and opened the way for a Catachan assault. In battle against the Orks, Marbo would often appear out of nowhere, slaying xenos at the most critical of moments. Gun emplacements, Ork Nobz, all would be attacked and slain before they could even fully react. When Killzkar was finally defeated by Straken, it was Marbo who carried the Colonel's broken body from the field of battle, even as the city around them was destroyed.[4]\n During the Third War for Armageddon, Sly Marbo once more waged a one-man war against the Orks. Usually, groups of a dozen or so elite Assassins were required to venture into Armageddon’s industrial wastelands - enough warriors to complete whatever mission command had for them, but sometimes, a lone warrior would be dispatched - one with enough skill and experience to triumph in battle against entire enemy kill teams.\n On Nordassa, Marbo destroyed a mighty Banelord Titan, how he managed to achieve such a feat is a mystery, as the details of his mission were later placed under seal, with even the report in his personnel file becoming classified.[8]\n At the start of the 13th Black Crusade, Marbo began his own shadow war against the enemies of the Imperium. The Jungle Fighter wrought so much havoc using well placed headshots and improvised explosives, that entire enemy encampments were found abandoned with the occupants either slain or having fled. The discovery of dead Traitor Astartes added to the mystery, and soon fearful guardsmen began to flood the Astra Militarum's service newspaper, the Regimental Standard, with reports of strange events and sightings. Initial investigation led the Standard to believe it could only be the work of loyalist Astartes operating within the area, who had simply deemed it unimportant to inform the guard of their presence. Upon later, now classified investigation, they realised it was the handiwork none other than Sly Marbo, with any record of his involvement being sealed by Catachan High Command.[6]\n As a man who always works alone, Sly Marbo only uses what he can carry with him - which, being a Catachan Jungle Fighter, is a lot. Yet Sly travels relatively light - he's incredibly adept at using the entire battlefield as a lethal weapon. Marbo doesn't rely on the relics and gadgets of the Dark Age of Technology to get the job done - he's eliminated targets without number with just his Ripper Pistol, Envenomed Blade and his bare hands, and, on a few rare occasions, the target's bare hands.[7]\n Marbo has also been known to utilise a variety of deadly explosives, including Frag Grenades, Krak Grenades, Melta Bombs and Demolition Charges.\n \n—Colonel Traupman of the Catachan XII, awarding Marbo the Star of Terra for his actions on Sask's World.[2][9]\n Sly Marbo miniature\n Sly Marbo Dark Millennium Card (2007)\n Sly Marbo Dark Millennium Card (2002)\n Sly Marbo miniature (8th Edition)\n The following information is not to be regarded as officially sanctioned and/ or is not written from an in-universe point of view. A detailed explanation of the term \"Trivia\" as used in the Lexicanum can be found here.\n Sly Marbo is originally based on the protagonist of the movie First Blood, John Rambo, Marbo is in fact the anagram of Rambo and Sly is the nickname of Sylvester Stallone, the actor who plays Rambo. Colonel Traupman is also a parody of Colonel Sam Trautman, Rambo's mentor within the film series.[1][9]\n"
}