{
  "title": "Straken",
  "url": "https://wh40k.lexicanum.com/wiki/%27Iron_Hand%27_Straken",
  "content": "\"Do I have to do everything myself?\"\n Colonel 'Iron Hand' Straken, renowned as Catachan's \"Man of Adamantium\", is the commanding officer of the Catachan II \"Green Vipers\" regiment of the Imperial Guard. His nom de guerre comes from his unique Bionics, which replaced the portions of his body devoured by a Miral Land Shark, which he killed mere moments later, by ripping its throat open with his teeth. Larger than life and twice as violent, Straken can always be found where the fighting is thickest.[1][5]\n Straken started out as a common trooper of the Catachan Jungle Fighters, working his way up through the ranks until he took the place of his mentor and predecessor, the illustrious Colonel Greiss.[1]\n Straken's operational history is lengthy, a veteran of decades of constant warfare, Straken has fought at the forefront of more battles and survived more wounds than most Imperial Guardsmen have had hot meals. To mention The Battle of Moden's Ridge, the Dulma'lin Cleansing, the Battle of Voltoris, the Ulani Aftermath and the fight for Vartol City, is to name but a few of his successful campaigns. Many of these battles were fought under Colonel Greiss, whose example Straken still follows by leading from the front, where he encourages the troops with insults, curses and the bark of orders. He is a man who scorns personal danger and whose central command ethic is to \"get stuck in\" and get the job done, on Vendal’s Landing he repulsed a phalanx of Daemon Engines with only twenty-two men, ten lasguns and a case of short-fused mining charges. At the battle of the Red Rain Straken personally defeated the notorious Dark Eldar Archon Yrekh  Drash in single combat, crushing the degenerate xenos’ head in his whirring bionic fist.[1][5]\n On Signis VIII, Straken lead the assault against the Tyranid hordes infesting the planet. During the initial battle, Straken and his men fought against swarms of lesser xenos and were able push them back. When a massive, multi-limbed Tyranid appeared, several of Straken's men were butchered, including one of his Captains before it was finally brought down by Demolition Charges. As the Colonel stood over the creature's body, he remarked that he had killed bigger things on Catachan, but despite his disappointment the fight was not yet over. When he turned to address his men, Straken was suddenly alerted by one of his troops, just as the massive beast rose and lunged towards him, whipping aside, Straken grabbed the alien's neck and drew his Catachan Fang. Even with the added strength of his bionics, it took four hard blows to finally sever the Hive Tyrant's head from it's body.[3]\n When the forces of Ork Warboss Killzkar besieged and conquered the mining planet of Dulma'lin, Straken and his men were tasked with infiltrating the planet's capital city and sabotaging the Ork war effort. The main army of Selvian Dragoons were supposed to provide the invasion force once the Catachans had completed their task, unfortunately they were ambushed and destroyed en route to the planet's capitol. Trapped within an Ork infested city, Straken and his Jungle Fighters, amongst them Sly Marbo, engaged in many solar months of sabotage and guerrilla warfare against the vast Ork hordes. Meanwhile, an Ork Kommando by the name of Snikrot led his own series of ambushes against the Colonel's forces, taking his foes' scalps as war trophies. The Colonel and the Kommando eventually engaged in a ferocious duel. Straken emerged the victor, while Sknikrot was grievously injured.[3]\n Straken later lead a strike force against the Ork hordes within the world's capitol. The war on Dulma'lin finally ended when the Colonel leapt onto the Warbosses giant Squiggoth. It was atop the rickety howdah strapped to the beast's back, that Straken finally came face to face with Killzkar himself. During the brutal dual that followed, the hulking Warboss fought like a Dreadnought gone wild, withstanding several wounds from Straken's Catachan Fang and even a direct shotgun blast to the face. Finding an opening amidst the Ork's fury, Straken tackled Killzkar and plunged his Fang deep into the Ork's neck. Straken gripped onto his blade as the pair desperately struggled, and were sent barreling over the edge of the howdah onto the battlefield below. Badly injured, his body broken from the fall, Straken then goaded the Squiggoth towards Killzkar even as the hulking Ork stood over him. The Warboss had almost no time to react as a massive shadow enveloped them both, and was flattened to a pulp beneath the beast's gigantic feet. When the Colonel's shattered body was discovered, he was carried off the battlefield by none other than Sly Marbo, even as the city around them collapsed under Catachan explosives. Straken was later credited with killing no less than thirty Orks and a number of Killa Kans during the earlier stages of the battle.[3][6]\n Colonel Straken has the respect of his regiment due to his prowess in battle, his sound tactical decisions and his refusal to send his troops into pointless conflicts where there is little to be gained. The Colonel has nothing but scorn for officers who fritter away lives to further their own careers. This attitude has caused tension in campaigns when the Catachan II has fought alongside regiments from other worlds whose commanders seek victory at any cost. Like any leader worth their salt, Straken never orders the troops in his command to do something he would be unwilling to do himself. When making a near hopeless assault against a fortified position, it is Straken who leads the charge.[1][5]\n Straken refuses to leave a wounded man behind, one story being that he dragged one trooper halfway across the continent of Martark on Ulani IV without rest or dropping his guard. Likewise his men will battle and retrieve him when he is injured, taking him to the medicae to be patched up with new cybernetics and sent back to the front. During his years of service the Colonel has suffered dozens of wounds in the line of duty, amongst the most serious being the arm he lost to the Miral land shark. Ever willing to turn a weakness into a strength, Straken replaced his missing hand with the deadly ‘devil’s claw’, an augmented appendage capable of punching through a ferrocrete wall. Though this and a plethora of other grave injuries should, by rights, have killed the indomitable Catachan several times over, Straken fights on with undiminished determination. His ravaged body is riddled with an ever-increasing number of gleaming bionics, and his orders are often punctuated by yells of him complaining that he has to do everything himself.[1][5]\n When necessary, Straken himself administers discipline to the guardsmen in his company . His punishments are only fatal when a grievous crime has been committed, or if he perceives a soldier to be fundamentally unfit for martial service, and if possible he will eschew the involvement of a Commissar. The Officio Prefectus see this as a usurpation of their officers duties - they know full well the legendary disregard the Catachans display towards their authority, and there is no better example of Catachan belligerence than Colonel \"Iron Hand\" Straken. They begrudgingly accept Straken and his men as exemplary soldiers of the Imperium, but always keep a close eye on the Green Vipers.[5]\n Currently, Straken is overseeing the raising of the reconstituted Catachan II to contribute to the Indomitus Crusade. He oversaw the defense of Catachan itself from the Forces of Chaos.[7]\n In combat, Straken typically carries a Plasma Pistol and Shotgun. He is also armed with his personal Catachan Fang knife, which he wields in his bionic arm of the same name.\n Straken during the events of Waiting Death[2]\n Straken Miniature (2000)\n Straken Miniature (2009)\n This article needs work on its citations.For help on citation see the citation guidelines. You can help Lexicanum by fixing it.\n This article purports to rely on sources which are not cited in the body of the text.For help on citation see the citation guidelines. You can help Lexicanum by fixing it.\n"
}