{
  "title": "Weirdboy",
  "url": "https://wh40k.lexicanum.com/wiki/%27Eadbanger",
  "content": "Weirdboyz are Ork psykers, unique in that they act as psychic sponges, absorbing and channelling the psychic energies of other Orks. All Orks are innately psychic, though in only a few - the Weirdboyz - are their psychic powers fully developed.[1]\n Weirdboyz have no control over their ability to absorb the Orkish psychic energy, only being able to channel and discharge it in the form of a specific effect, such as the Psychic Vomit and Gork'll Get 'Em!. Orks in battle are always chanting, stomping their feet and brandishing their weapons in an enthusiastic fashion. The anticipation and excitement floods the battlefield in Orkish psychic energy which is absorbed by Weirdboyz.[1]\n Weirdboyz dislike being around other Orks as the pure energy given off unconsciously by other Orks can build up in them and eventually results in an 'Eadbang if it can't be discharged safely. Weirdboyz discharge the energy in the form of a wave of energy erupting from its mouth much like vomiting fire. While the Weirdboy feels a lot better for this, those around him are unlikely to feel the same way. To this end, Weirdboyz are forced to live away from the rest of the Ork settlement. They live in large, raised houses built on copper stilts which help to channel their psychic power into the ground, like a wire conducts electricity. The 'Weirdhouses' are guarded at all times and Wyrdboyz aren't allowed to wander the camp without an escort of a couple of guards, or 'Minderz'.[1]\n Weirdboyz wear brightly-coloured and gaudy clothes and large, conspicuous hats to mark them out from other Orks, so they can be easily avoided - and also because the discomfort and danger of being psychic conduits often tempts them to hide or even run off when they are most needed. For the same reason, their clothing often incorporates bells, rattles and other devices that make a noise when the Weirdboyz moves.[1]\n Weirdboyz carry copper staffs around to help earth excess psychic energy. If a Weirdboy is caught in the middle of a group of excited Orks, things will quickly go from bad to worse and furniture will start flying around the room and guns will fire along with a variety of other strange things.[1]\n The 'Eadbang occurs when a Wyrdboy cannot let go of his built up power fast enough. Literally, their heads explode, and the psychic overspill can be so great that the heads of other nearby Orks explode as well. For this reason, Weirdboyz are also known as 'Eadbangers. During combat, a Weirdboyz can build up immense amounts of power, causing him a lot of pain. His psychic outburst however is highly effective at frying handfuls of the enemy at once. Weirdboyz often find themselves dragged onto the battlefield by their Minderz and used as living weapons, usually involuntarily. The Minderz drag the poor Weirdboy towards the enemy lines and when they see sparks in his eyes they snatch away his copper stick and try to bodily aim him in the direction of the enemy. The results can be devastating, both for and against the Orks. If given the chance, Weirdboyz will flee the battlefield in order to escape the pain of the gathering of Orks.[1]\n Warpheads are Weirdboyz that - unlike normal Wyrdboyz - actually revel in and enjoy their powers - having become addicted to the sensations created by using their powers.[1]\n Wurrboyz are unsavory Beast Snaggas Weirdboys who channel Waaagh! energy in its most primal, animalistic form. When they unleash its power, roiling storms of psychic energy is through their foes and their enemies are left as little more than shriveled husks, or into mindless Squigs. Off the battlefield, the Wurrboyz take on what is possibly an even more important role in their tribes. They use their pseudo-shamanistic powers to receive visions from the Orks' gods, Gork and Mork, which they relay to their fellow Beast Snaggas as grand proclamations and barely coherent prophecies. These declarations will then spur their fellow Beast Snagga hunters, towards the biggest prey around. So important is the Wurrboyz' role in guiding Beast Snagga society, that they are granted a level of respect far above that of a regular Ork Weirdboy. To the Beast Snaggas, Wurrboyz are seen as divine oracles, rather than dangerous ticking time bombs like Orks see Weirdboyz as.[4]\n In order to gain some measure of focus over their Psychic powers, Wurrboyz will make use of Eyez of Mork devices.[4]\n Weirdboy \n Weirdboy \n Weirdboy \n Weirdboy \n Weirdboy \n Weirdboy \n Weirdboy \n Goffs\n Evil Sunz\n Bad Moons\n Snakebites\n Blood Axes\n Deathskulls\n Warphead Outcast\n Weirdboy (1st Edition)\n Weirdboy (1st Edition)\n Weirdboy (1st Edition)\n Bad Moons Weirdboy Warphead (2nd Edition)\n Weirdboy (4th Edition)\n This article purports to rely on sources which are not cited in the body of the text.For help on citation see the citation guidelines. You can help Lexicanum by fixing it.\n \n"
}